CSI API ETABS v1

# cCaseHyperStaticSetCase Method

---

Initializes a hyperstatic load case. If this function is called for an
existing load case, all items for the case are reset to their default value

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetCase(
    	string Name
    )

    Function SetCase (
    	Name As String
    ) As Integer

    Dim instance As cCaseHyperStatic
    Dim Name As String
    Dim returnValue As Integer

    returnValue = instance.SetCase(Name)

    int SetCase(
    	String^ Name
    )

    abstract SetCase :
            Name : string -> int

#### Parameters

Name

    Type: SystemString
The name of an existing or new load case. If this is an existing case, that
case is modified; otherwise, a new case is added

#### Return Value

Type: Int32
Returns zero if the load case is successfully initialized; otherwise it
returns a nonzero value

Remarks

See Also

#### Reference

cCaseHyperStatic Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com